Improve README architecture diagram
